In [2]:
!pip install pandas

Collecting pandas
  Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (91 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.3.5-cp313-cp313-macosx_14_0_arm64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl (10.7 MB)
Using cached numpy-2.3.5-cp313-cp313-macosx_14_0_arm64.whl (5.1 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4/4 [pandas]━━━━ 3/4 [pandas]
Successfully installed numpy-2.3.5 pandas-2.3.3 pytz-2025.2 tzdata-2025.2

In [3]:
import pandas as pd

In [ ]:
# Crear dataframe a partir de una lista de listas

data = [['Juan', 25], ['Pedro', 34], ['Luis', 45, 10]]

df = pd.DataFrame(data, columns=['Nombre', 'Edad', 'Peso'])
df

  Nombre  Edad  Peso
0   Juan    25   NaN
1  Pedro    34   NaN
2   Luis    45  10.0

In [10]:
# Crear dataframe a partir de un diccionario

data = {
    'Nombre': ['Juan', 'Pedro', 'Luis'],
    'Edad': [25, 26, 34]
}

df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1  Pedro    26
2   Luis    34

In [12]:
df = pd.read_csv('data/data1.csv')

df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [14]:
df = pd.read_csv('data/data2', sep='|')

df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [19]:
df = pd.read_csv('data/data_without_header', sep=',', header=None, names=['Nombre', 'Edad', 'Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [20]:
df = pd.read_json('data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [ ]:
## Metodos de pandas

df.head()
df.tail()
df.info()
df.describe()

In [29]:
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [30]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nombre  3 non-null      object
 1   edad    3 non-null      int64
 2   ciudad  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [33]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [35]:
df.count()

nombre    3
edad      3
ciudad    3
dtype: int64

In [36]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [38]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [44]:
type(df[['nombre']])

pandas.core.frame.DataFrame

In [41]:
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [47]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [50]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [51]:
df[df['edad'] > 30]

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [52]:
data = {
    'Grupo': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Valor': [10, 20, 15, 25, 12, 18]
}

df = pd.DataFrame(data)

In [54]:
df.groupby('Grupo').sum()

       Valor
Grupo
A         37
B         63

In [55]:
df.groupby('Grupo').mean()

           Valor
Grupo
A      12.333333
B      21.000000

In [65]:
df = pd.read_csv('data/data2', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [64]:
df.dropna()

  nombre  edad     ciudad
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [66]:
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [68]:
df.dropna(subset=['edad'])

  nombre  edad     ciudad
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [69]:
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [75]:
df.fillna(df['edad'].mean(), inplace=True)
df

  nombre  edad     ciudad
0   Juan  32.5     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [76]:
df

  nombre  edad     ciudad
0   Juan  32.5     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [77]:
data = {
    'A': [1, 2, 3, 4],
    'B': [6, 7, 8, 9]
}

In [78]:
df = pd.DataFrame(data)
df

   A  B
0  1  6
1  2  7
2  3  8
3  4  9

In [83]:
df['A_nuevo'] = df['A'].apply(lambda x: x**2)

In [84]:
df

   A  B  A_nuevo
0  1  6        1
1  2  7        4
2  3  8        9
3  4  9       16